[
  {
    "title": "Vex - Anonymous Video Answers",
    "status": "Rough idea",
    "source": "Found online",
    "memo": "I keep thinking about how people are scared to ask real questions online. What if we could get honest answers from real people without anyone knowing who's asking? Like a therapist explaining what anxiety actually feels like, or a firefighter talking about their first call. Just real people sharing real experiences.",
    "implementation": [
      "Start simple - just let people upload short video answers",
      "Keep it anonymous so people feel safe to be honest",
      "Maybe verify some experts so we know the advice is good",
      "Focus on quality answers, not how many followers someone has",
      "Let the community decide what's worth watching"
    ],
    "updated": "2025-01-16"
  },
  {
    "title": "Whispurr - Ephemeral Messenger",
    "status": "Rough idea",
    "source": "My notes",
    "memo": "What if we had a messenger where conversations don't stick around forever? Like for when you want to talk about something sensitive but don't want it saved in a permanent record. All chats disappear after 24 hours unless you want them to stay.",
    "implementation": [
      "Start with simple 1-on-1 chats that auto-delete",
      "Add a 'burner message' feature for read-once messages",
      "Maybe add emoji masks so people can't see what you're typing if they look over your shoulder",
      "Keep it simple - no cloud backup, everything stays on your phone",
      "Focus on teens and young adults who want digital lightness"
    ],
    "updated": "2025-01-16"
  },
  {
    "title": "Circles - Community Platform",
    "status": "Rough idea",
    "source": "My notes",
    "memo": "I keep seeing people struggle to manage their communities online. What if we had a platform where organizers could control exactly how their groups work? Like setting rules about what people can share, when conversations expire, and who can join.",
    "implementation": [
      "Start with basic group management - who can join, what they can post",
      "Add features for community managers to control the conversation",
      "Maybe let groups have different rules for different times",
      "Focus on people who run study groups, clubs, or professional communities",
      "Keep it simple but powerful for organizers who need control"
    ],
    "updated": "2025-01-16"
  }
]

